"""
定数定義 社会保険 -> 厚生年金保険
"""
import sys

from meta.厚生年金保険 import I厚生年金保険, 厚生年金保険料率
from meta.社会保険 import 標準額区分
from utils import get_range_dict_value


class 厚生年金保険_R2(I厚生年金保険):
    """
    厚生年金保険 令和2年9月分(10月納付分)以降の定義

    参考:
        厚生年金保険の保険料｜日本年金機構
        https://www.nenkin.go.jp/service/kounen/hokenryo/hoshu/20150515-01.html

        厚生年金保険料額表｜日本年金機構
        https://www.nenkin.go.jp/service/kounen/hokenryo/ryogaku/ryogakuhyo/index.html

        厚生年金保険料率の引上げが終了します ｜報道発表資料｜厚生労働省
        https://www.mhlw.go.jp/stf/houdou/0000175945.html

        子ども・子育て拠出金率が改定されました｜日本年金機構
        https://www.nenkin.go.jp/oshirase/taisetu/2020/202005/20200514.html
    """
    __標準報酬額区分の定義: dict[range,標準額区分] = {
        range(-sys.maxsize,      93_000): 標準額区分(等級= 1, 月額= 88_000),
        range(      93_000,     101_000): 標準額区分(等級= 2, 月額= 98_000),
        range(     101_000,     107_000): 標準額区分(等級= 3, 月額=104_000),
        range(     107_000,     114_000): 標準額区分(等級= 4, 月額=110_000),
        range(     114_000,     122_000): 標準額区分(等級= 5, 月額=118_000),
        range(     122_000,     130_000): 標準額区分(等級= 6, 月額=126_000),
        range(     130_000,     138_000): 標準額区分(等級= 7, 月額=134_000),
        range(     138_000,     146_000): 標準額区分(等級= 8, 月額=142_000),
        range(     146_000,     155_000): 標準額区分(等級= 9, 月額=150_000),
        range(     155_000,     165_000): 標準額区分(等級=10, 月額=160_000),
        range(     165_000,     175_000): 標準額区分(等級=11, 月額=170_000),
        range(     175_000,     185_000): 標準額区分(等級=12, 月額=180_000),
        range(     185_000,     195_000): 標準額区分(等級=13, 月額=190_000),
        range(     195_000,     210_000): 標準額区分(等級=14, 月額=200_000),
        range(     210_000,     230_000): 標準額区分(等級=15, 月額=220_000),
        range(     230_000,     250_000): 標準額区分(等級=16, 月額=240_000),
        range(     250_000,     270_000): 標準額区分(等級=17, 月額=260_000),
        range(     270_000,     290_000): 標準額区分(等級=18, 月額=280_000),
        range(     290_000,     310_000): 標準額区分(等級=19, 月額=300_000),
        range(     310_000,     330_000): 標準額区分(等級=20, 月額=320_000),
        range(     330_000,     350_000): 標準額区分(等級=21, 月額=340_000),
        range(     350_000,     370_000): 標準額区分(等級=22, 月額=360_000),
        range(     370_000,     395_000): 標準額区分(等級=23, 月額=380_000),
        range(     395_000,     425_000): 標準額区分(等級=24, 月額=410_000),
        range(     425_000,     455_000): 標準額区分(等級=25, 月額=440_000),
        range(     455_000,     485_000): 標準額区分(等級=26, 月額=470_000),
        range(     485_000,     515_000): 標準額区分(等級=27, 月額=500_000),
        range(     515_000,     545_000): 標準額区分(等級=28, 月額=530_000),
        range(     545_000,     575_000): 標準額区分(等級=29, 月額=560_000),
        range(     575_000,     605_000): 標準額区分(等級=30, 月額=590_000),
        range(     605_000,     635_000): 標準額区分(等級=31, 月額=620_000),
        range(     635_000, sys.maxsize): 標準額区分(等級=32, 月額=650_000),
    }

    __厚生年金保険料率 = 厚生年金保険料率(厚生年金保険料率=0.183, 子ども子育て拠出金率=0.0036)

    def 標準報酬額区分(self, 報酬月額: int) -> int:
        return get_range_dict_value(self.__標準報酬額区分の定義, 報酬月額)

    @property
    def 保険料率(self) -> 厚生年金保険料率:
        return self.__厚生年金保険料率
